Revit 2027 API
ParameterTypeId.Profile1OffsetX Property
 "Horizontal Profile Offset"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId Profile1OffsetX { get; }
Public Shared ReadOnly Property Profile1OffsetX As ForgeTypeId
	Get
public:
static property ForgeTypeId^ Profile1OffsetX {
	ForgeTypeId^ get ();
}
static member Profile1OffsetX : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace